"use strict";
// ЗАДАЧИ ДЛЯ СОБЕСЕДОВАНИЙ НА ПОНИМАНИЕ ОСНОВ

// 1) Какое будет вывыведено значение? 
// let x = 5;alert( x++);

// 2) Чему равно выражение:
// [] + false - null + true
// console.log(typeof([] + false - null + true)); 

// 3) Что выведет этот код? 
// let y = 1;
// let x = y = 2; 
// alert(x);

// 4) Чему равна сумма:
// [] + 1 + 2
// console.log([] + 1 + 2); // 12 

// 5) Что выведет этот код?

// alert( "1"[0]); // Будет 1 

// 6) Чему равно? 

// console.log(2 && 1 && null && 0 && undefined);
// И - запинается на лжи
// Или - заминается на правде
// 7 Есть ли разница между выражениями? 

// console.log(!!(1 && 2) === (1 && 2));

// 8 Что выведет этот код ?

// alert(null || 2 && 3|| 4);

// 9 Правда ли, что a == b?
// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a == b);

// Разные переменные, поэтому ответ будет False

// 10 Что выведет этот код? 

// alert( +"Infinity");

// будет тип данных число

// 11 Верно ли сравнение? 
// console.log("Ёжик" > "яблоко");

// 12 Чему равно? 
// console.log(0 || "" || 2 || undefined || true || false);